2025-fin-graduate-project/Falling-Detection-STM32/Application/STM32N6570-DK/Src/main.c
      if (latch_active)
      {
        /* Semi-transparent red banner in center of screen (y=185, h=110) */
        UTIL_LCD_FillRect(0, 185, LCD_FG_WIDTH, 110, 0xC0DD0000);
        UTIL_LCD_SetFont(&Font24);
        UTIL_LCD_SetBackColor(0x00000000);
        UTIL_LCD_SetTextColor(UTIL_LCD_COLOR_WHITE);
        UTIL_LCDEx_PrintfAt(0, 228, CENTER_MODE, "!! FALL DETECTED !!");
        UTIL_LCD_SetFont(&Font20);
        UTIL_LCD_SetTextColor(UTIL_LCD_COLOR_YELLOW);
        UTIL_LCDEx_PrintfAt(0, 258, CENTER_MODE, "Score %.0f%%  (threshold %.0f%%)",
                            (double)(fall_state.fall_score * 100.0f),
                            (double)(GRU_FALL_SCORE_THRESHOLD * 100.0f));
      }
    }
    else
    {
      uint32_t warmup_target = POSE_WINDOW_SIZE; /* always 40-step window */
      UTIL_LCD_SetTextColor(UTIL_LCD_COLOR_YELLOW);
      UTIL_LCDEx_PrintfAt(0, LINE(1), CENTER_MODE, "Fall detector warming %lu/%u",
                          fall_state.frame_count,
                          warmup_target);
    }
  }
  UTIL_LCD_SetTextColor(UTIL_LCD_COLOR_WHITE);
  UTIL_LCDEx_PrintfAt(0, LINE(2), CENTER_MODE, "KP %lu/%u P%lu M%lu Max %.2f",
                      pose_debug_metrics.visible_keypoints,
                      (uint32_t)AI_POSE_PP_POSE_KEYPOINTS_NB,
                      pose_debug_metrics.person_keypoints,
                      pose_debug_metrics.person_missing_count,
                      (double)pose_debug_metrics.max_keypoint_proba);
  UTIL_LCDEx_PrintfAt(0, LINE(3), CENTER_MODE, "Raw[%d,%d] Deq[%.2f,%.2f]",
                      pose_debug_metrics.raw_min,
                      pose_debug_metrics.raw_max,
                      (double)pose_debug_metrics.raw_min_dequant,
                      (double)pose_debug_metrics.raw_max_dequant);
  UTIL_LCDEx_PrintfAt(0, LINE(4), CENTER_MODE, "Out %lux%lux%lu PP %ld",
                      pose_debug_metrics.output_width,
                      pose_debug_metrics.output_height,
                      pose_debug_metrics.output_channels,
                      (long)pose_debug_metrics.postprocess_status);
  UTIL_LCDEx_PrintfAt(0, LINE(20), CENTER_MODE, "Inference: %ums", inference_ms);

  UTIL_LCD_SetTextColor(UTIL_LCD_COLOR_WHITE);
  UTIL_LCD_SetFont(&Font20);
  UTIL_LCD_SetBackColor(0);

  Display_WelcomeScreen();

  SCB_CleanDCache_by_Addr(lcd_fg_buffer[lcd_fg_buffer_rd_idx], LCD_FG_FRAMEBUFFER_SIZE);
  ret = HAL_LTDC_ReloadLayer(&hlcd_ltdc, LTDC_RELOAD_VERTICAL_BLANKING, LTDC_LAYER_2);
  assert(ret == HAL_OK);
  lcd_fg_buffer_rd_idx = 1 - lcd_fg_buffer_rd_idx;
}

static void Update_PoseDebugMetrics(stai_ptr *nn_out, int32_t nn_out_len[], stai_size number_output, spe_pp_out_t *p_postprocess)
{
  pose_debug_metrics.raw_min = 0;
  pose_debug_metrics.raw_max = 0;
  pose_debug_metrics.raw_min_dequant = 0.0f;
  pose_debug_metrics.raw_max_dequant = 0.0f;
  pose_debug_metrics.max_keypoint_proba = 0.0f;
  pose_debug_metrics.visible_keypoints = 0;
  pose_debug_metrics.person_keypoints = 0;
  pose_debug_metrics.person_present = 0u;
  pose_debug_metrics.postprocess_valid = 0u;
  pose_debug_metrics.draw_keypoints = 0u;
  pose_debug_metrics.keypoints_too_spread = 0u;
  pose_debug_metrics.output_width = STAI_NETWORK_OUT_1_WIDTH;
  pose_debug_metrics.output_height = STAI_NETWORK_OUT_1_HEIGHT;
  pose_debug_metrics.output_channels = STAI_NETWORK_OUT_1_CHANNEL;

  if ((number_output > 0) && (nn_out[0] != NULL) && (nn_out_len[0] > 0))
  {
    int8_t *raw_output = (int8_t *)nn_out[0];
    int32_t raw_len = nn_out_len[0];
    int8_t raw_min = raw_output[0];
    int8_t raw_max = raw_output[0];

    for (int32_t i = 1; i < raw_len; i++)
    {
      if (raw_output[i] < raw_min)
      {
        raw_min = raw_output[i];
      }
      if (raw_output[i] > raw_max)
      {
        raw_max = raw_output[i];
      }
    }

    pose_debug_metrics.raw_min = raw_min;
    pose_debug_metrics.raw_max = raw_max;
    pose_debug_metrics.raw_min_dequant = pp_params.raw_scale * (float32_t)((int32_t)raw_min - (int32_t)pp_params.raw_zero_point);
    pose_debug_metrics.raw_max_dequant = pp_params.raw_scale * (float32_t)((int32_t)raw_max - (int32_t)pp_params.raw_zero_point);
  }

  if ((p_postprocess != NULL) && (p_postprocess->pOutBuff != NULL))
  {
    /* Collect confidence scores from the raw postprocess output for presence logic.
     * We don't use the smoothed features from the pipeline here to avoid a deadlock
     * where the pipeline doesn't update because no person is present, and no person
     * is present because the pipeline isn't updating. */
    float32_t scores[POSE_KP_COUNT];
    for (uint32_t i = 0; i < POSE_KP_COUNT; i++)
    {
      float32_t proba = p_postprocess->pOutBuff[i].proba;
      scores[i] = proba;

      if (proba > pose_debug_metrics.max_keypoint_proba)
      {
        pose_debug_metrics.max_keypoint_proba = proba;
      }
      if (proba >= AI_POSE_PP_CONF_THRESHOLD)
      {
        pose_debug_metrics.visible_keypoints++;
      }
      if (proba >= FALL_PERSON_CONF_THRESHOLD)
      {
        pose_debug_metrics.person_keypoints++;
      }
    }

    /* Robust Presence: Top-5 Average Confidence. 
     * If at least 5 keypoints are detected with some confidence, 
     * their average must be above threshold. */
    for (int i = 0; i < 5; i++)
    {
      for (int j = i + 1; j < POSE_KP_COUNT; j++)
      {
        if (scores[j] > scores[i])
        {
          float32_t tmp = scores[i];
          scores[i] = scores[j];
          scores[j] = tmp;
        }
      }
    }

    float32_t top5_avg = (scores[0] + scores[1] + scores[2] + scores[3] + scores[4]) / 5.0f;

    /* Presence: top-5 average confidence must be >= 0.2 */
    pose_debug_metrics.person_present = (top5_avg >= 0.2f) ? 1u : 0u;

    /* Keypoint spread: bounding box of confident keypoints (normalized 0-1).
     * Too large a span means noisy/scattered detections — skip visualization. */
    float32_t x_min = 1.0f, x_max = 0.0f;
    float32_t y_min = 1.0f, y_max = 0.0f;
    uint32_t n_spread = 0u;
    for (uint32_t i = 0; i < POSE_KP_COUNT; i++)
    {
      if (p_postprocess->pOutBuff[i].proba >= AI_POSE_PP_CONF_THRESHOLD)
      {
        float32_t x = p_postprocess->pOutBuff[i].x_center;
        float32_t y = p_postprocess->pOutBuff[i].y_center;
        if (x < x_min) x_min = x;
        if (x > x_max) x_max = x;
        if (y < y_min) y_min = y;
        if (y > y_max) y_max = y;
        n_spread++;
      }
    }
    if (n_spread >= 2u)
    {
      float32_t span_x = x_max - x_min;
      float32_t span_y = y_max - y_min;
      pose_debug_metrics.keypoints_too_spread =
        ((span_x > FALL_KP_SPREAD_MAX) || (span_y > FALL_KP_SPREAD_MAX)) ? 1u : 0u;
    }
    else
    {
      pose_debug_metrics.keypoints_too_spread = 0u;
    }
  }
}

static void LCD_init(void)
{
  BSP_LCD_Init(0, LCD_ORIENTATION_LANDSCAPE);

  /* Preview layer Init */
  LayerConfig.X0          = lcd_bg_area.X0;
  LayerConfig.Y0          = lcd_bg_area.Y0;
  LayerConfig.X1          = lcd_bg_area.X0 + lcd_bg_area.XSize;
  LayerConfig.Y1          = lcd_bg_area.Y0 + lcd_bg_area.YSize;
  LayerConfig.PixelFormat = LCD_PIXEL_FORMAT_RGB565;
  LayerConfig.Address     = (uint32_t) lcd_bg_buffer;

